Repository: fifyrio/app-agents-mvp
Catalog: frontend/lib/l10n/app_*.arb
Languages: de, is, zh

# commonCancel
source: Cancel
de: Abbrechen
is: Hætta við
zh: 取消

# commonConfirm
source: Confirm
de: Bestätigen
is: Staðfesta
zh: 确认

# commonSave
source: Save
de: Speichern
is: Vista
zh: 保存

# commonDelete
source: Delete
de: Löschen
is: Eyða
zh: 删除

# commonRetry
source: Retry
de: Nochmal
is: Reyna aftur
zh: 重试

# commonLoading
source: Loading...
de: Lädt...
is: Hleður...
zh: 加载中...

# commonError
source: Error
de: Fehler
is: Villa
zh: 错误

# commonSuccess
source: Success
de: Erfolg
is: Tókst
zh: 成功

# commonClose
source: Close
de: Schließen
is: Loka
zh: 关闭

# settingsTitle
source: Settings
de: Einstellungen
is: Stillingar
zh: 设置

# settingsLanguage
source: Language
de: Sprache
is: Tungumál
zh: 语言

# settingsTermsOfUse
source: Terms of Use
de: Nutzungsbedingungen
is: Notkunarskilmálar
zh: 使用条款

# settingsPrivacy
source: Privacy
de: Datenschutz
is: Persónuvernd
zh: 隐私政策

# settingsHelpSupport
source: Help & Support
de: Hilfe & Support
is: Hjálp og stuðningur
zh: 帮助与支持

# settingsSelectLanguage
source: Select Language
de: Sprache wählen
is: Veldu tungumál
zh: 选择语言

# profileTitle
source: Profile
de: Profil
is: Prófíll
zh: 个人中心

# profileHelloCreator
source: Hello Creator
de: Hallo Creator
is: Hæ, skapari
zh: 你好，创作者

# profileMyVideos
source: My Videos
de: Meine Videos
is: Myndbönd mín
zh: 我的视频

# profileNoVideos
source: No videos yet
de: Noch keine Videos
is: Engin myndbönd enn
zh: 还没有视频

# profileCreateFirst
source: Create your first video from the home page
de: Starte dein erstes Video über Home
is: Byrjaðu fyrsta myndbandið á heimasíðunni
zh: 从首页创建您的第一个视频

# homeCreate
source: Create
de: Erstellen
is: Búa til
zh: 创作

# homeTextToVideo
source: Text to Video
de: Text zu Video
is: Texti í myndband
zh: 文字转视频

# homeImageToVideo
source: Image to Video
de: Bild zu Video
is: Mynd í myndband
zh: 图片转视频

# homeGenerate
source: Generate ({credit} credit)
de: Generieren ({credit} Credits)
is: Búa til ({credit} inneign)
zh: 生成（{credit} 积分）

# homeGenerateUnlimited
source: Generate (Unlimited)
de: Generieren (unbegrenzt)
is: Búa til (ótakmarkað)
zh: 生成（不限次数）

# homeGetPro
source: Get Pro
de: Pro holen
is: Fá Pro
zh: 升级专业版

# homePro
source: Pro
zh: 专业版

# homeStyles
source: Styles
de: Stile
is: Stílar
zh: 风格

# homeInspireMe
source: Inspire me
de: Inspiration
is: Innblástur
zh: 获取灵感

# homeUploadImage
source: Upload Image
de: Bild hochladen
is: Hlaða upp mynd
zh: 上传图片

# homeImageReady
source: Image Ready
de: Bild bereit
is: Mynd tilbúin
zh: 图片就绪

# homeUploading
source: Uploading...
de: Hochladen...
is: Hleð upp...
zh: 上传中...

# homeEnterPrompt
source: Enter your prompt here...
de: Prompt hier eingeben...
is: Sláðu inn kvaðningu...
zh: 在此输入您的提示词...

# homeAnimateImage
source: Describe how you want to animate your image...
de: Beschreibe die Animation...
is: Lýstu hvernig myndin á að hreyfast...
zh: 描述您想要如何让图片动起来...

# homeTryPrompts
source: Try Prompts
de: Prompts testen
is: Prófa kvaðningar
zh: 试试这些提示

# homeStartingGeneration
source: Starting Generation...
de: Generierung startet...
is: Byrja myndgerð...
zh: 开始生成...

# homeGeneratingVideo
source: Generating Video...
de: Video wird erstellt...
is: Bý til myndband...
zh: 生成视频中...

# homeViewVideo
source: View Video
de: Video ansehen
is: Skoða myndband
zh: 查看视频

# msgNoCredits
source: No Credits
de: Keine Credits
is: Engin inneign
zh: 积分不足

# msgNoCreditsDesc
source: You have no credits left. Upgrade to Pro for unlimited video generation!
de: Keine Credits mehr. Hol dir Pro für unbegrenzte Videos!
is: Inneign búin. Uppfærðu í Pro fyrir ótakmörkuð myndbönd.
zh: 您的积分已用完。升级到专业版即可无限次生成视频！

# msgEmptyPrompt
source: Empty Prompt
de: Leerer Prompt
is: Tóm kvaðning
zh: 提示词为空

# msgEmptyPromptDesc
source: Please enter a prompt to generate video
de: Bitte gib einen Prompt ein, um ein Video zu generieren.
is: Sláðu inn kvaðningu til að búa til myndband.
zh: 请输入提示词以生成视频

# msgImageUploading
source: Image Uploading
de: Bild wird hochgeladen
is: Mynd hleðst upp
zh: 图片上传中

# msgImageUploadingDesc
source: Please wait for image upload to complete
de: Bitte warte, bis der Upload fertig ist.
is: Bíddu þar til upphleðslu lýkur.
zh: 请等待图片上传完成

# msgNoImageUploaded
source: No Image Uploaded
de: Kein Bild
is: Engin mynd
zh: 未上传图片

# msgNoImageUploadedDesc
source: Please upload an image for image-to-video generation
de: Bitte lade ein Bild für Bild-zu-Video hoch.
is: Hladdu upp mynd fyrir mynd-í-myndband.
zh: 请上传图片以进行图片转视频生成

# msgUploadComplete
source: Upload Complete
de: Upload fertig
is: Upphleðslu lokið
zh: 上传完成

# msgUploadCompleteDesc
source: Image uploaded successfully and ready for video generation
de: Bild geladen – bereit zum Generieren.
is: Mynd tilbúin fyrir myndbandagerð.
zh: 图片上传成功，可以开始生成视频了

# msgUploadFailed
source: Upload Failed
de: Upload fehlgeschlagen
is: Upphleðsla mistókst
zh: 上传失败

# msgUploadFailedDesc
source: Failed to upload image: {error}
de: Fehler beim Bild-Upload: {error}
is: Mynd-upphleðsla mistókst: {error}
zh: 图片上传失败：{error}

# msgStyleApplied
source: Style Applied
de: Stil aktiv
is: Stíll virkur
zh: 风格已应用

# msgStyleAppliedDesc
source: {style} style has been selected
de: {style} Stil ausgewählt.
is: {style} stíll valinn.
zh: 已选择 {style} 风格

# msgInspirationReady
source: Inspiration Ready!
de: Inspiration fertig
is: Hugmynd tilbúin
zh: 灵感已就绪！

# msgInspirationReadyDesc
source: AI has generated an enhanced prompt for you
de: Die KI hat einen besseren Prompt erstellt.
is: Gervigreind bjó til betri kvaðningu.
zh: AI 已为您生成增强版提示词

# msgInspirationFailed
source: Inspiration Failed
de: Inspiration fehlgeschlagen
is: Hugmynd mistókst
zh: 获取灵感失败

# msgInspirationFailedDesc
source: Failed to get AI inspiration: {error}
de: Prompt konnte nicht geladen werden: {error}
is: Ekki tókst að ná kvaðningu: {error}
zh: 获取 AI 灵感失败：{error}

# msgCreditRefunded
source: Credit Refunded
de: Credit zurück
is: Inneign endurgreidd
zh: 积分已退还

# msgCreditRefundedDesc
source: Your credit has been refunded due to generation failure.
de: Dein Credit wurde wegen des Fehlers gutgeschrieben.
is: Inneign skilað vegna villu.
zh: 由于生成失败，您的积分已退还。

# msgLanguageChanged
source: Language Changed
de: Sprache geändert
is: Tungumáli breytt
zh: 语言已更改

# msgLanguageChangedDesc
source: App language has been updated
de: App-Sprache aktualisiert.
is: Tungumál forritsins uppfært.
zh: 应用语言已更新

# msgCouldNotOpenLink
source: Could not open the link
de: Link konnte nicht geöffnet werden
is: Gat ekki opnað tengil
zh: 无法打开链接

# msgFailedToOpenLink
source: Failed to open the link: {error}
de: Fehler beim Öffnen: {error}
is: Mistókst að opna: {error}
zh: 打开链接失败：{error}

# msgVideoFailed
source: Video Failed
de: Video fehlgeschlagen
is: Myndband mistókst
zh: 视频生成失败

# msgVideoFailedDesc
source: This video generation failed
de: Dieses Video konnte nicht erstellt werden.
is: Ekki tókst að búa til myndbandið.
zh: 此视频生成失败

# msgVideoProcessing
source: Video Processing
de: Video wird verarbeitet
is: Myndband í vinnslu
zh: 视频处理中

# msgVideoProcessingDesc
source: This video is still being generated
de: Video rendert noch.
is: Myndbandið er enn að vinnast.
zh: 此视频仍在生成中

# msgLoadVideosFailed
source: Failed to load videos: {error}
de: Videos konnten nicht geladen werden: {error}
is: Mistókst að hlaða myndböndum: {error}
zh: 加载视频失败：{error}

# timeJustNow
source: Just now
de: Gerade eben
is: Rétt í þessu
zh: 刚刚

# timeMinuteAgo
source: 1 minute ago
de: vor 1 Minute
is: fyrir 1 mínútu
zh: 1 分钟前

# timeMinutesAgo
source: {count} minutes ago
de: vor {count} Minuten
is: fyrir {count} mínútum
zh: {count} 分钟前

# timeHourAgo
source: 1 hour ago
de: vor 1 Stunde
is: fyrir 1 klukkustund
zh: 1 小时前

# timeHoursAgo
source: {count} hours ago
de: vor {count} Stunden
is: fyrir {count} klukkustundum
zh: {count} 小时前

# timeDayAgo
source: 1 day ago
de: vor 1 Tag
is: fyrir 1 degi
zh: 1 天前

# timeDaysAgo
source: {count} days ago
de: vor {count} Tagen
is: fyrir {count} dögum
zh: {count} 天前

# timeMonthAgo
source: 1 month ago
de: vor 1 Monat
is: fyrir 1 mánuði
zh: 1 个月前

# timeMonthsAgo
source: {count} months ago
de: vor {count} Monaten
is: fyrir {count} mánuðum
zh: {count} 个月前

# timeYearAgo
source: 1 year ago
de: vor 1 Jahr
is: fyrir 1 ári
zh: 1 年前

# timeYearsAgo
source: {count} years ago
de: vor {count} Jahren
is: fyrir {count} árum
zh: {count} 年前

# videoResultTitle
source: Result
de: Ergebnis
is: Niðurstaða
zh: 结果

# videoLoadingVideo
source: Loading video...
de: Video wird geladen...
is: Hleð myndbandi...
zh: 视频加载中...

# videoFailedToLoad
source: Failed to load video
de: Video konnte nicht geladen werden
is: Mistókst að hlaða myndbandi
zh: 视频加载失败

# videoFailedToLoadDesc
source: Failed to load video: {error}
de: Fehler beim Laden: {error}
is: Villa við upphleðslu: {error}
zh: 视频加载失败：{error}

source: Video player not available
de: Player nicht verfügbar
is: Spilari ekki tiltækur
zh: 视频播放器不可用

# videoShare
source: Share
de: Teilen
is: Deila
zh: 分享

# videoDownload
source: Download
is: Hlaða niður
zh: 下载

# videoRegenerate
source: Regenerate
de: Neu generieren
is: Endurgera
zh: 重新生成

# videoCopy
source: Copy
de: Kopieren
is: Afrita
zh: 复制

# videoCopied
source: Copied
de: Kopiert
is: Afritað
zh: 已复制

# videoCopiedDesc
source: Title copied to clipboard
de: Titel in die Zwischenablage kopiert.
is: Titill afritaður á klemmuspjald.
zh: 标题已复制到剪贴板

# videoShareMessage
source: Check out this AI-generated video: {url}
de: Schau dir dieses KI-Video an: {url}
is: Skoðaðu þetta KI-myndband: {url}
zh: 看看这个 AI 生成的视频：{url}

# videoShareSubject
source: AI Generated Video from Sova
de: KI-Video von Sova
is: KI-myndband frá Sova
zh: 来自 Sova 的 AI 生成视频

# videoShareFailed
source: Failed to share video. Please try again.
de: Video konnte nicht geteilt werden. Bitte erneut versuchen.
is: Mistókst að deila. Reyndu aftur.
zh: 分享视频失败，请重试。

# videoDownloadFailed
source: Failed to download video. Please try again.
de: Video konnte nicht heruntergeladen werden. Bitte erneut versuchen.
is: Mistókst að sækja. Reyndu aftur.
zh: 下载视频失败，请重试。

# videoRegenerating
source: Regenerating
de: Neu generieren
is: Endurgera
zh: 重新生成中

# videoRegeneratingDesc
source: Please enter a new prompt to generate another video.
de: Bitte gib einen neuen Prompt ein, um ein weiteres Video zu generieren.
is: Sláðu inn nýja kvaðningu fyrir annað myndband.
zh: 请输入新的提示词以生成另一个视频。

# pricingTitle
source: Unlock Full Potential
de: Mehr Möglichkeiten freischalten
is: Opnaðu meiri möguleika
zh: 解锁全部潜能

# pricingSubtitle
source: Create stunning videos with AI
de: Erstelle beeindruckende KI-Videos
is: Búðu til glæsileg KI-myndbönd
zh: 用 AI 创作精美视频

# pricingUnlimitedGeneration
source: Unlimited video generation
de: Unbegrenzte Videos
is: Ótakmörkuð myndbönd
zh: 无限次视频生成

# pricingNoWatermarks
source: No watermarks
de: Keine Wasserzeichen
is: Engin vatnsmerki
zh: 无水印

# pricingPriorityProcessing
source: Priority processing
de: Priorisierte Verarbeitung
is: Forgangur í vinnslu
zh: 优先处理

# pricingWeekly
source: Weekly
de: Wöchentlich
is: Vikulegt
zh: 每周

# pricingWeeklyPrice
source: $7.99/week
de: $7.99/Woche
is: $7.99/viku
zh: $7.99/周

# pricingMonthly
source: Monthly
de: Monatlich
is: Mánaðarlegt
zh: 每月

# pricingMonthlyPrice
source: $39.99/month
de: $39.99/Monat
is: $39.99/mánuði
zh: $39.99/月

# pricingBestValue
source: BEST VALUE
de: BESTER DEAL
is: BESTA GILD
zh: 最超值

# pricingSubscribe
source: Subscribe
de: Abonnieren
is: Gerast áskrifandi
zh: 订阅

# pricingRestorePurchases
source: Restore Purchases
de: Käufe wiederherstellen
is: Endurheimta kaup
zh: 恢复购买

# pricingSubscriptionSuccess
source: Subscription activated successfully!
de: Abo aktiviert!
is: Áskrift virkjuð!
zh: 订阅激活成功！

# pricingSubscriptionFailed
source: Failed to process subscription
de: Abo konnte nicht verarbeitet werden.
is: Mistókst að vinna áskrift.
zh: 处理订阅失败

# pricingRestoreSuccess
source: Purchases restored successfully!
de: Käufe wiederhergestellt!
is: Kaup endurheimt!
zh: 购买恢复成功！

# pricingRestoreFailed
source: Failed to restore purchases
de: Käufe konnten nicht wiederhergestellt werden.
is: Mistókst að endurheimta kaup.
zh: 恢复购买失败

# onboardingTitle1
source: Generate Videos with AI Magic
de: KI-Videozauber
is: KI-myndbönd á augabragði
zh: 用 AI 魔法生成视频

# onboardingDesc1
source: Turn text or images into stunning AI-generated videos in seconds.
de: Verwandle Text oder Bilder in Sekunden in Videos.
is: Breyttu texta eða myndum í myndbönd á sekúndum.
zh: 将文字或图片转换为精美的 AI 生成视频，只需几秒钟。

# onboardingTitle2
source: Transform Your Ideas Instantly
de: Ideen sofort umsetzen
is: Hugmyndir í myndband strax
zh: 即刻实现你的创意

# onboardingDesc2
source: Create professional videos with just a prompt. No editing skills required.
de: Erstelle Videos mit einem Prompt – ganz ohne Schnittwissen.
is: Búðu til fagmyndbönd með einni kvaðningu.
zh: 只需一个提示词即可创作专业视频，无需编辑技能。

# onboardingTitle3
source: Unlimited Creative Power
de: Kreativität ohne Limits
is: Sköpun án takmarkana
zh: 无限创作力量

# onboardingDesc3
source: Bring your imagination to life with cutting-edge AI video generation.
de: Nutze moderne KI, um deine Ideen zum Leben zu erwecken.
is: Nýttu háþróaða KI til að lifga hugmyndirnar.
zh: 用尖端 AI 视频生成技术让您的想象力变为现实。

# onboardingNext
source: Next
de: Weiter
is: Áfram
zh: 下一步

# promptPreviewPrompt
source: Prompt
is: Kvaðning
zh: 提示词

# promptPreviewTryUsecase
source: Try this usecase
de: Use Case testen
is: Prófa þetta dæmi
zh: 试试这个案例

# promptPreviewFailedToLoad
source: Failed to load media
de: Medien konnten nicht geladen werden
is: Mistókst að hlaða miðli
zh: 加载媒体失败

# analyzeVideoTitle
source: Analyze Video
de: Video analysieren
is: Greina myndband
zh: 分析视频

# analyzeVideoAnalyzeImages
source: Analyze Images
de: Bilder analysieren
is: Greina myndir
zh: 分析图片

# analyzeVideoHelp
source: Help
de: Hilfe
is: Hjálp
zh: 帮助

# analyzeVideoHelpMessage
source: Video analysis help coming soon
de: Hilfe zur Analyse folgt bald.
is: Leiðbeiningar eru á leiðinni.
zh: 视频分析帮助即将推出

# analyzeVideoImportVideo
source: Import Video
de: Video importieren
is: Flytja inn myndband
zh: 导入视频

# analyzeVideoUploadVideo
source: Upload Video
de: Video hochladen
is: Hlaða upp myndbandi
zh: 上传视频

# analyzeVideoSupportedFormats
source: Supported formats: MP4, MOV, AVI | Max duration: 5 minutes
de: Formate: MP4, MOV, AVI | max. 5 Min
is: MP4, MOV, AVI | hámark 5 mín
zh: 支持格式：MP4、MOV、AVI | 最长时长：5 分钟

# analyzeVideoVideoPreview
source: Video Preview
de: Vorschau
is: Forskoðun
zh: 视频预览

# analyzeVideoAnalysisPanel
source: Analysis Panel
de: Analysepanel
is: Greiningarspjald
zh: 分析面板

# analyzeVideoAnalyzeButton
source: Analyze Video
de: Video analysieren
is: Greina myndband
zh: 分析视频

# analyzeVideoAnalyzing
source: Analyzing...
de: Analysiere...
is: Greini...
zh: 分析中...

# analyzeVideoExtractingThumbnail
source: Extracting thumbnail...
de: Vorschaubild wird erstellt...
is: Bý til smámynd...
zh: 提取缩略图中...

# analyzeVideoUploadingThumbnail
source: Uploading thumbnail...
de: Vorschaubild wird hochgeladen...
is: Hleð upp smámynd...
zh: 上传缩略图中...

# analyzeVideoAiAnalyzing
source: AI analyzing...
de: KI analysiert...
is: KI greinir...
zh: AI 分析中...

# analyzeVideoUploadProgress
source: Upload: {progress}%
is: Upphleðsla: {progress}%
zh: 上传：{progress}%

# analyzeVideoGeneratedPrompts
source: AI Generated Prompts
de: KI-Prompts
is: KI-kvaðningar
zh: AI 生成的提示词

# analyzeVideoSelectPrompt
source: Select a prompt to use or customize it below
de: Prompt wählen oder unten anpassen
is: Veldu eða breyttu kvaðningu hér.
zh: 选择一个提示词使用或在下方自定义

# analyzeVideoOption
source: Option {number}
is: Valkostur {number}
zh: 选项 {number}

# analyzeVideoPromptPanel
source: Prompt Panel
is: Kvaðningaspjald
zh: 提示词面板

# analyzeVideoEnterPrompt
source: Enter your prompt...
de: Prompt eintippen...
is: Sláðu inn kvaðningu...
zh: 输入您的提示词...

# analyzeVideoSeed
source: Seed
is: Fræ
zh: 种子

# analyzeVideoCopy
source: Copy
de: Kopieren
is: Afrita
zh: 复制

# analyzeVideoClear
source: Clear
de: Leeren
is: Hreinsa
zh: 清除

# analyzeVideoError
source: Error
de: Fehler
is: Villa
zh: 错误

# analyzeVideoFailedToSelect
source: Failed to select video: {error}
de: Video konnte nicht ausgewählt werden: {error}
is: Mistókst að velja myndband: {error}
zh: 选择视频失败：{error}

# analyzeVideoFailedToLoad
source: Failed to load video: {error}
de: Video konnte nicht geladen werden: {error}
is: Mistókst að hlaða myndbandi: {error}
zh: 加载视频失败：{error}

# analyzeVideoNoVideo
source: No Video
de: Kein Video
is: Ekkert myndband
zh: 无视频

# analyzeVideoNoVideoMessage
source: Please select a video first
de: Bitte wähle zuerst ein Video aus.
is: Veldu myndband áður en þú heldur áfram.
zh: 请先选择视频

# analyzeVideoEmptyPrompt
source: Empty Prompt
de: Leerer Prompt
is: Tóm kvaðning
zh: 提示词为空

# analyzeVideoEmptyPromptMessage
source: No prompt text to copy
de: Kein Prompt zum Kopieren.
is: Enginn texti til að afrita.
zh: 没有提示词可复制

# analyzeVideoCopied
source: Copied
de: Kopiert
is: Afritað
zh: 已复制

# analyzeVideoCopiedMessage
source: Prompt copied to clipboard
de: Prompt in die Zwischenablage kopiert.
is: Kvaðning afrituð á klemmuspjald.
zh: 提示词已复制到剪贴板

# analyzeVideoSuccess
source: Success
de: Erfolg
is: Tókst
zh: 成功

# analyzeVideoSuccessMessage
source: Generated {count} prompt suggestions
de: {count} Prompt-Vorschläge erstellt.
is: Bjó til {count} kvaðningar.
zh: 生成了 {count} 个提示词建议

# analyzeVideoAnalysisFailed
source: Analysis Failed
de: Analyse fehlgeschlagen
is: Greining mistókst
zh: 分析失败

# navHome
source: Home
de: Start
is: Heim
zh: 首页

# navStudio
source: Studio
is: Stúdíó
zh: 工作室

# navAnalyze
source: Analyze
de: Analyse
is: Greina
zh: 分析

# navProfile
source: Profile
de: Profil
is: Prófíll
zh: 我的
